const data = [
    {
        "id": 1,
        "img": "/img/2837160_detail.jpg",
        "title": "Веб-разработка с применением Node и Express",
        "more details": "https://vk.com/doc7608079_519481650?hash=0ba91e442df0609476&dl=08cb6c4f7f3fb29cbd",
        "description": `Создавайте динамические веб-приложения с применением Express — ключевого компонента из стека разработки Node/JavaScript. Итан Браун описывает работу с Express 5 на примере создания полноценного приложения. В книге рассматриваются все этапы и компоненты — от серверного рендеринга до разработки API для работы с одностраничными приложениями (SPA).<br>
        Express является золотой серединой между устоявшимся фреймворком и отсутствием фреймворка вообще, поэтому он оставляет вам определенную свободу при архитектурном выборе. Эта книга предоставит лучшие решения для фронтенд- и бэкенд-разработчиков, использующих Express. Научитесь смотреть на веб-разработку под новым углом!<br>
        - Создайте систему шаблонизации для отображения динамических данных.<br>
        - Подробно изучите объекты запроса и отклика, промежуточное ПО и маршрутизацию URL-адресов.<br>
        - Создайте симуляцию продакшен-среды и выполняйте в ней тестирование.<br>
        - Научитесь долговременному хранению информации в документных базах данных с помощью MongoDB и в реляционных базах данных — с помощью PostgreSQL.<br>
        - Открывайте другим программам доступ к вашим ресурсам благодаря API.<br>
        - Создавайте защищенные приложения с применением аутентификации, авторизации и HTTPS.<br>
        - Интегрируйтесь с социальными сетями, включайте геолокацию и многое другое.<br>
        - Внедрите план по запуску и сопровождению вашего приложения.<br>
        - Освойте критически важные навыки отладки.`,
        "author": "Браун И."
    },
    {
        "id": 2,
        "img": "/img/2837165_detail.jpg",
        "title": "Современный скрапинг веб-сайтов с помощью Python",
        "more details": "https://vk.com/doc-162380315_462010810?hash=a8beb34f7fd87ce038&dl=897365e930c2d63cf7",
        "description": `Если программирование напоминает волшебство, то веб-скрапинг — это очень сильное колдунство. Написав простую автоматизированную программу, можно отправлять запросы на веб-серверы, запрашивать с них данные, а затем анализировать их и извлекать необходимую информацию. Новое расширенное издание книги знакомит не только с веб-скрапингом, но и поможет собрать любого вида данные в современном Интернете.<br>
        В части I основное внимание уделено механике веб-скрапинга: как с помощью Python запрашивать информацию с веб-сервера, производить базовую обработку серверного отклика и организовать автоматизированное взаимодействие с сайтами. В части II исследованы более специфичные инструменты и приложения, которые пригодятся при любом сценарии веб-скрапинга.<br>
        - Разбирайте сложные HTML-страницы.<br>
        - Разрабатывайте поисковые роботы с помощью фреймворка Scrapy.<br>
        - Изучайте методы хранения данных, полученных с помощью скрапинга.<br>
        - Считывайте и извлекайте данные из документов.<br>
        - Очищайте и нормализуйте плохо отформатированные данные.<br>
        - Читайте и пишите информацию на естественных языках.<br>
        - Освойте поиск по формам и логинам.<br>
        - Изучите скрапинг JavaScript и работу с API.<br>
        - Используйте и пишите программы для преобразования изображений в текст.<br>
        - Учитесь обходить скрапинговые ловушки и блокаторы ботов.<br>
        - Протестируйте собственный сайт с помощью скрапинга.`,
        "author": "Митчелл Р."
    },
    {
        "id": 3,
        "img": "/img/2723851_detail.jpg",
        "title": "CSS. Полный справочник. Визуальное форматирование веб-страниц",
        "more details": "https://vk.com/doc50238030_445274455?hash=6b0428a6dbfcf1bc6d&dl=e13c03d3a5089fa1f9",
        "description": `В первую очередь эта книга рассчитана на веб-дизайнеров и разработчиков мобильных приложений, которые заинтересованы в использовании новейших средств визуального оформления веб-страниц, характеризующихся широкими функциональными возможностями и повышенной производительностью. В новом издании справочника по CSS содержится подробное описание всех новых инструментов, добавленных в последнюю версию спецификации.<br>
        CSS — активно развивающаяся технология стилевого форматирования веб-содержимого, выводимого на экранах электронных устройств, распечатываемого на принтерах, воспроизводимого через синтезаторы речи и с помощью экранных дикторов, а также отображаемого в окнах всевозможных онлайн-мессенджеров. Поддержка CSS внедрена во все современные браузеры, что позволяет применять стилевую разметку на экранах любых размеров и любых типов электронных устройств, включая компьютеры, смартфоны, игровые приставки, телевизоры, интерактивные терминалы и даже умные часы. Авторы книги поделятся секретами настройки взаимодействия с пользователями, быстрого оформления документов и предотвращения возможных неполадок. Вы узнаете, как оживить собственные веб-приложения, снабдив их продуманным и привлекательным пользовательским интерфейсом, в котором задействуются переходы, анимации, рамки, фоновые изображения и другие стилевые средства.`,
        "author": "Мейер Э., Уэйл Э."
    },
    {
        "id": 4,
        "img": "/img/2689904_detail.jpg",
        "title": "Python. Справочник. Полное описание языка",
        "more details": "https://vk.com/doc7608079_448293932?hash=8282987454ee66a7e0&dl=b08d4e2a569b2f4e44",
        "description": `Python — один из наиболее популярных современных языков программирования. Третье издание этого практического руководства представляет собой исчерпывающий справочник, содержащий описание большинства модулей обширной стандартной библиотеки Python и наиболее часто используемых модулей сторонних производителей. Справочник ориентирован на версии Python 2.7 и 3.5, но также включает информацию об изменениях и новшествах, появившихся в версии Python 3.6.<br>
        Книга охватывает чрезвычайно широкий спектр областей применения Python, включая веб-приложения, сетевое программирование, обработку XML-документов, взаимодействие с базами данных и высокоскоростные вычисления. Она станет идеальным подспорьем как для тех, кто решил изучить Python, имея предварительный опыт программирования на других языках, так и для тех, кто уже использует этот язык в своих разработках.`,
        "author": "Мартелли А., Рейвенскрофт А., Холден С."
    },
    {
        "id": 5,
        "img": "/img/2585858_detail.jpg",
        "title": "React.js. Быстрый старт",
        "more details": "https://vk.com/doc7608079_448292759?hash=8f92abea990ba5b301&dl=f5fb6be9caca21322b",
        "description": `Незаменимая вводная книга по технологии React для взыскательных JavaScript-разработчиков. Все самое интересное о сверхпопулярном инструменте от компании Facebook. В книге рассмотрены основные концепции высокопроизводительного программирования при помощи React, реальные примеры кода и доступные блок-схемы. <br>
        .Прочитав ее, вы научитесь:<br>
        — Создавать и использовать собственные компоненты React наряду с универсальными компонентами DOM <br>
        — Писать компоненты для таблиц данных, позволяющие редактировать, сортировать таблицу, выполнять в ней поиск и экспортировать ее содержимое <br>
        — Использовать дополнительный синтаксис JSX в качестве альтернативы для вызовов функций<br>
        — Запускать низкоуровневый гибкий процесс сборки, который освободит вам время и поможет сосредоточиться на работе с React <br>
        — Работать с инструментами ESLint, Flow и Jest, позволяющими проверять и тестировать код по мере разработки приложения <br>
        — Обеспечивать коммуникацию между компонентами при помощи Flux<br>
        — В итоге у вас получится полноценное веб-приложение, позволяющее сохранять данные на стороне клиента.`,
        "author": "Стефанов С."
    },
    {
        "id": 6,
        "img": "/img/2549320_detail.jpg",
        "title": "Распределенные алгоритмы. Интуитивный подход",
        "more details": "https://vk.com/doc7608079_447389866?hash=673c8a8c3bbdc85edc&dl=d9b20d5621e7f5c946",
        "description": `Эта книга представляет собой пособие по распределенным алгоритмам. Автор уделяет внимание не столько тонкостям математических моделей, сколько конкретным примерам. Здесь вы не найдете теорем и доказательств, которые зачастую оказываются камнем преткновения для студентов. Книга рассматривает преимущественно алгоритмическое мышление как таковое. Данный подход поможет читателю освоить большое количество алгоритмов за относительно краткий период времени. Описания алгоритмов краткие, сопровождаются наглядными примерами и практическими задачами. В приложении к книге многие алгоритмы описаны на псевдокоде.`,
        "author": "Фоккинк У."
    },
    {
        "id": 7,
        "img": "/img/2525010_detail.jpg",
        "title": "Создаем динамические веб-сайты с помощью PHP, MySQL, JavaScript, CSS и HTML5",
        "more details": "https://vk.com/doc7608079_481625821?hash=ae996c14483d3713b4&dl=374a42911a23cd0b78",
        "description": `Если программирование напоминает волшебство, то веб-скрапинг — это очень сильное колдунство. Написав простую автоматизированную программу, можно отправлять запросы на веб-серверы, запрашивать с них данные, а затем анализировать их и извлекать необходимую информацию. Новое расширенное издание книги знакомит не только с веб-скрапингом, но и поможет собрать любого вида данные в современном Интернете.<br>
        В части I основное внимание уделено механике веб-скрапинга: как с помощью Python запрашивать информацию с веб-сервера, производить базовую обработку серверного отклика и организовать автоматизированное взаимодействие с сайтами. В части II исследованы более специфичные инструменты и приложения, которые пригодятся при любом сценарии веб-скрапинга.<br>
        - Разбирайте сложные HTML-страницы.<br>
        - Разрабатывайте поисковые роботы с помощью фреймворка Scrapy.<br>
        - Изучайте методы хранения данных, полученных с помощью скрапинга.<br>
        - Считывайте и извлекайте данные из документов.<br>
        - Очищайте и нормализуйте плохо отформатированные данные.<br>
        - Читайте и пишите информацию на естественных языках.<br>
        - Освойте поиск по формам и логинам.<br>
        - Изучите скрапинг JavaScript и работу с API.<br>
        - Используйте и пишите программы для преобразования изображений в текст.<br>
        - Учитесь обходить скрапинговые ловушки и блокаторы ботов.<br>
        - Протестируйте собственный сайт с помощью скрапинга.`,
        "author": "Митчелл Р."
    },
    {
        "id": 8,
        "img": "/img/2510710_detail.jpg",
        "title": "Oracle PL/SQL за 10 минут",
        "more details": "https://vk.com/doc123534285_449590929?hash=169aef8b1d1f6e9efa&dl=191b264e94b9518543",
        "description": `В книге даются простые и практические ответы на вопросы, требующие быстрого решения. Этот краткий справочник состоит из 26 уроков. Потратив не более 10 минут на каждый (или даже меньше!), вы научитесь всему, что требуется знать, чтобы выгодно пользоваться языком PL/SQL в работе с СУБД Oracle. Этот удобный карманный справочник начинается с простых примеров извлечения данных и постепенно переходит к более сложным вопросам, включая соединения, подзапросы, регулярные выражения и полноценный текстовый поиск, хранимые процедуры, курсоры, триггеры, табличные ограничения и многое другое.`,
        "author": "Форта Б."
    },
    {
        "id": 9,
        "img": "/img/2701874_detail.jpg",
        "title": "Java: эффективное программирование",
        "more details": "https://vk.com/doc7608079_458668407?hash=4e0453b21b6671b8d3&dl=2fcc709f83b2da2ebe",
        "description": `Язык программирования Java существенно изменился со времени предыдущего издания книги, опубликованного вскоре после выпуска Java 6. Этот классический труд тщательно обновлен, чтобы читатели могли в полной мере воспользоваться возможностями последних версий языка и его библиотек функций. В современном Java поддерживается несколько парадигм программирования. Поэтому программисты часто испытывают потребность в конкретных рекомендациях, которые и описаны в данной книге.<br>
        .Как и в предыдущих изданиях, каждая глава книги состоит из ряда разделов, в каждом из которых описаны конкретные советы, приведены тонкости платформы Java и содержатся обновленные примеры кода. Для каждой темы приводится всеобъемлющее описание и пояснения, как следует поступить в данном случае, как не следует, и почему.<br>
        .Третье издание охватывает особенности языка программирования и библиотек, появившихся в Java 7, 8 и 9, в том числе конструкции функционального программирования, добавленные к своим объектно-ориентированным корням. В книгу включены также многие новые советы, а также глава, посвященная лямбда-выражениям и потокам.`,
        "author": "Блох Дж."
    },
    {
        "id": 10,
        "img": "/img/2660649_detail.jpg",
        "title": "Шаблоны C++. Справочник разработчика",
        "more details": "https://vk.com/doc7608079_492060932?hash=091de87be0cfa84d65&dl=e2c9f03762209e8353",
        "description": `Это книга, описывающая работу с шаблонами C++ от азов до самых "темных закутков", в которые вряд ли придется заглядывать при повседневной работе даже самым искушенным программистам, которая будет одинаково полезна как программисту, желающему повысить свой начальный уровень умений и понимания шаблонов, так и профессиональному разработчику сложнейших шаблонных библиотек. Основы работы с шаблонами, шаблоны с параметрами, не являющимися типами, вариативные шаблоны, вопросы передачи аргументов в шаблоны, метапрограммирование, специализация и перегрузка, вывод аргументов, полиморфизм и наследование шаблонов, шаблоны выражений и даже возможности работы с шаблонами, которые должны появиться в следующем после C++17 стандарте языка - вряд ли найдется такая связанная с шаблонами тема, о которой можно было бы сказать, что она слабо освещена в этой книге. <br>
        Книга рекомендуется в первую очередь для профессиональных программистов в качестве справочного пособия, но она будет полезна программистам на C++ любого уровня - каждый найдет в ней важный и нужный материал для себя. Книга предполагает знание читателем современного языка программирования C++. <br>
        Шаблоны представляют собой одну из наиболее сильных сторон C++, но они все еще остаются недостаточно используемыми, а зачастую и неверно понимаемыми, несмотря на постоянно растущий уровень как языка C++, так и сообщества программистов на этом языке. Во втором издании книги три автора, являющиеся экспертами в данной области, показывают, зачем, когда и как использовать современные шаблоны, чтобы создавать программное обеспечение, более понятное, быстрое, эффективное и легко поддерживаемое. Данное издание описывает новые возможности стандартов C++11, C++14 и C++17 и демонстрирует последние достижения в области шаблонов C++ для создания широкого спектра приложений. Авторы подробно объясняют все новые возможности языка, которые улучшают шаблоны или взаимодействие с ними, рассматривая такие темы, как вариативные шаблоны, обобщенные лямбда-выражения, вывод аргументов шаблонов классов, конструкцию if времени компиляции, передаваемые ссылки и пользовательские литералы. Они также глубоко вникают в фундаментальные концепции языка (такие как категории значений) и полностью охватывают стандартные свойства типов.`,
        "author": "Вандевурд Д., Джосаттис Н., Грегор Д."
    },
    {
        "id": 11,
        "img": "/img/2635702_detail.jpg",
        "title": "Высоконагруженные приложения. Программирование, масштабирование, поддержка",
        "more details": "https://vk.com/doc497812770_492781873?hash=ed6da4386afa652198&dl=6358e7b14063f5f7d8",
        "description": `В этой книге вы найдете ключевые принципы, алгоритмы и компромиссы, без которых не обойтись при разработке высоконагруженных систем для работы с данными. Материал рассматривается на примере внутреннего устройства популярных программных пакетов и фреймворков. В книге три основные части, посвященные, прежде всего, теоретическим аспектам работы с распределенными системами и базами данных. От читателя требуются базовые знания SQL и принципов работы баз данных.`,
        "author": "Клеппман М."
    },
    {
        "id": 12,
        "img": "/img/2630823_detail.jpg",
        "title": "Android. Сборник рецептов. Задачи и решения для разработчиков приложений",
        "more details": "https://vk.com/doc7608079_478253007?hash=e089c734118327b4bb&dl=950669ed96ba488447",
        "description": `Эта книга должна помочь сообществу разработчиков Android поделиться знаниями, которые позволят сделать их приложения еще лучше. Все знания, изложенные в этой книге, облегчат разработку приложений для платформы Android. Книга облегчает создание работоспособных приложений для платформы Android с помощью 230 проверенных рецептов. Второе издание содержит рецепты для работы с пользовательскими интерфейсами, мультисенсорными жестами, механизмами определения местоположения, веб-службами и конкретными возможностями устройства, такими как телефон, видеокамера и акселерометр. Вы также научитесь упаковывать свое приложение для магазина Google Play Market.<br>
        Книга идеально подходит для разработчиков, владеющими языком Java, основами платформы Android и интерфейса Java SE API. Она содержит рецепты, предоставленные более чем тридцатью разработчиками. Каждый рецепт содержит четкое решение и пример кода, готовый к использованию.`,
        "author": "Дарвин Я."
    },
    {
        "id": 13,
        "img": "/img/2758358_detail.jpg",
        "title": "C++ за 21 день",
        "more details": "https://vk.com/doc7608079_459310769?hash=b0d13d0b1320e99966&dl=f136b5c2318827eb5f",
        "description": `Выделив всего один час на урок вы можете приобрести квалификацию, необходимую для начала программирования на языке C++. В книге представлен полный курс обучения программированию, который позволит быстро овладеть основами языка и перейти к более сложным понятиям и концепциям.<br>
        .Эта книга, полностью переработанная с учетом стандарта C++14 и готовящегося стандарта C++17, представляет язык C++ с практической точки зрения — как средство создания быстрых, простых и эффективных приложений на C++.`,
        "author": "Рао С."
    },
    {
        "id": 14,
        "img": "/img/2750036_detail.jpg",
        "title": "Kotlin. Программирование для профессионалов",
        "more details": "https://vk.com/doc7608079_539284362?hash=8cbd2c647d5fc77b19&dl=b1f67bd5e8bdbe752d",
        "description": `Если программирование напоминает волшебство, то веб-скрапинг — это очень сильное колдунство. Написав простую автоматизированную программу, можно отправлять запросы на веб-серверы, запрашивать с них данные, а затем анализировать их и извлекать необходимую информацию. Новое расширенное издание книги знакомит не только с веб-скрапингом, но и поможет собрать любого вида данные в современном Интернете.<br>
        В части I основное внимание уделено механике веб-скрапинга: как с помощью Python запрашивать информацию с веб-сервера, производить базовую обработку серверного отклика и организовать автоматизированное взаимодействие с сайтами. В части II исследованы более специфичные инструменты и приложения, которые пригодятся при любом сценарии веб-скрапинга.<br>
        - Разбирайте сложные HTML-страницы.<br>
        - Разрабатывайте поисковые роботы с помощью фреймворка Scrapy.<br>
        - Изучайте методы хранения данных, полученных с помощью скрапинга.<br>
        - Считывайте и извлекайте данные из документов.<br>
        - Очищайте и нормализуйте плохо отформатированные данные.<br>
        - Читайте и пишите информацию на естественных языках.<br>
        - Освойте поиск по формам и логинам.<br>
        - Изучите скрапинг JavaScript и работу с API.<br>
        - Используйте и пишите программы для преобразования изображений в текст.<br>
        - Учитесь обходить скрапинговые ловушки и блокаторы ботов.<br>
        - Протестируйте собственный сайт с помощью скрапинга.`,
        "author": "Скин Дж., Гринхол Д."
    },
    {
        "id": 15,
        "img": "/img/2300090_detail.jpg",
        "title": "Программирование для Android",
        "more details": "https://vk.com/doc7608079_437581811?hash=15e9208be6531bd7b9&dl=21fdc119353c23871d",
        "description": `Kotlin - язык программирования со статической типизацией, который взяла на вооружение Google в ОС Android.<br>
        .Книга Джоша Скина и Дэвида Гринхола основана на популярном курсе Kotlin Essentials от Big Nerd Ranch. Яркие и полезные примеры, четкие объяснения ключевых концепций и основополагающих API не только знакомят с языком Kotlin, но и учат эффективно использовать его возможности, а так же позволяют освоить среду разработки IntelliJ IDEA от JetBrains. <br>
        Не важно опытный вы разработчик, который хочет выйти за рамки Java, или изучаете первый язык программирования. Джош и Дэвид проведут вас от основных принципов к расширенному использованию Kotlin, чтобы вы могли создавать надежные и эффективные приложения.`,
        "author": "Митчелл Р."
    },
    {
        "id": 16,
        "img": "/img/qghykjvZxtQ.jpg",
        "title": "Мобильная разработка. Галерея шаблонов",
        "more details": "https://vk.com/doc7608079_459416300?hash=2bcc7672097c171825&dl=4061d07efb30a5d7c1",
        "description": `Когда вам потребуется срочно создать хорошо спроектированное, легкое в навигации мобильное приложение, времени, чтобы заново изобретать велосипед, у вас не будет. В данной книге рассмотрены более 70 шаблонов проектирования мобильных приложений и приведено большое количество скриншотов из современных приложений iOS, Android, Blackberry, WebOS, Windows Mobile и Symbian.<br>
        .Автор книги подробно описывает шаблоны проектирования, разделенные на 10 категорий, включая антишаблоны. Независимо от того, будете вы проектировать простое iPhone-приложение или прило¬жение, предназначенное для работы в каждой из представленных на рынке популярных мобильных операционных систем, данные шаблоны позволят вам решать часто встречающиеся сложные задачи, которые связаны с проектированием приложений.<br>`,
        "author": "Нейл Т."
    },
    {
        "id": 17,
        "img": "/img/2339256_detail.jpg",
        "title": "Разработка приложений для Windows 8 на языке C#",
        "more details": "https://vk.com/doc190302325_346362264?hash=268b4504a87385ab10&dl=0b148d0bd685380ef3",
        "description": `Рассмотрены принципы разработки Windows Store-приложений для Windows 8 на языке C# в среде Visual Studio 2012. Описаны основные возможности платформы и показаны сценарии их практического использования. Особое внимание уделяется дизайну и проектированию приложений. Описана работа с живыми плитками, контрактами, сервисом определения местоположения, сенсорами, уведомлениями и камерой. Рассказывается про хранение и доступ к данным, интернационализацию и размещение приложений в специализированном магазине приложений Windows Store. <br>`,
        "author": "Пугачев С., Шериев А., Кичинский К."
    },
    {
        "id": 18,
        "img": "/img/2284544_detail.jpg",
        "title": "jQuery.Сборник рецептов / (+CD) (2 изд) (мягк) (Профессиональное программирование). ",
        "more details": "https://vk.com/doc7608079_456689054?hash=cc47c2c9209baa8990&dl=82a21cfd073bc5c67c",
        "description": `Книга является сборником решений наиболее часто встречающихся задач при веб-программировании пользовательских интерфейсов с использованием библиотеки jQuery. Рассмотрены практически все методы и вспомогательные функции jQuery, в том числе обеспечивающие взаимодействие jQuery и AJAX. Подробно рассказано о надстройке UI jQuery.`,
        "author": "Самков Г."
    },
    {
        "id": 19,
        "img": "/img/2198598_detail.jpg",
        "title": "AJAX Программирование для Интернета",
        "more details": "https://vk.com/doc7608079_437215328?hash=3e3fbd791bdf625656&dl=782ef7855ccea37373",
        "description": `Описана технология AJAX и показаны возможности, которые открываются перед разработчиком с ее применением. Рассмотрена объектная модель документа: DOM в JavaSript и DOM-функции в PHP. Изложены основы языка XML и формат JSON. Показан принцип генерации асинхронных запросов к серверу средствами JavaScript. Сделан обзор основных JavaScript-библиотек: Prototype, Scriptaculous, ExtJS и jQuery. Подробно рассмотрены популярные и перспективные библиотеки ExtJS и jQuery: описана объектная модель языка JavaScript, на которой базируются эти библиотеки; применение AJAX-запросов; обработка событий и др. Приведено большое количество практических примеров. <br>
        <br>
        Компакт-диск содержит дистрибутивы Web-сервера, модуля РНР и сервера MySQL, исходные коды описываемых библиотек, распространяемых на основании лицензии GPL, а также примеры из книги. <br>
        <br>
        Для Web-программистов`,
        "author": "Бенкен Е., Самков Г."
    },
    {
        "id": 20,
        "img": "/img/2171457_detail.jpg",
        "title": "PHP 5 в подлиннике",
        "more details": "https://vk.com/doc13770151_452189392?hash=ab54be2bbc5070eec7&dl=90984fdf5f501f40a4",
        "description": `В книге "PHP 5 в подлиннике" , издание второе, рассматриваются основы функционирования Web-серверов, конфигурирования сервера Apache, инструментарий Web-разработчика (в том числе утилиты отладки сценариев), синтаксис и стандартные функции языка. Во втором издании добавлены главы про технологии AJAX и DbSimple. Авторы этой книги непосредственно участвовали в разработке пятой версии PHP, поэтому вы получите наиболее полные и достоверные сведения из первых рук. Руководство адресовано как профессиональным Web-разработчикам, желающим в кратчайшие сроки начать использование новых возможностей PHP 5, так и новичкам, владеющим лишь базовыми навыками программирования и не знакомым с PHP. Вы получите сведения о функционировании Web-серверов, интерактивной отладке Web-сценариев и сборке исполняемого модуля PHP в ОС Unix. Научитесь работать с формами, файлами, СУБД MySQL, регулярными выражениями, графикой, почтой, сессиями. Освоите новые возможности, появившиеся в пятой версии языка: работу с XML-документами, объектно-ориентированное программирование, технику использования исключений, а также подходам к отделению PHP-кода от HTML-шаблонов сайта. Благодаря компонентному подходу к созданию сценариев, описанному в книге, вы сможете создавать эффективные и легко расширяемые сайты.`,
        "author": "Котеров Д."
    },
    {
        "id": 21,
        "img": "/img/2365928_detail.jpg",
        "title": "Сила JavaScript. 68 способов эффективного использования JS",
        "more details": "https://vk.com/doc7608079_465503247?hash=ff318c6edee3b53ec5&dl=20b036f530b165cc27",
        "description": `Эта книга поможет вам освоить всю мощь языка программирования JavaScript и научит применять его максимально эффективно. Автор описывает внутреннюю работу языка на понятных практических примерах, которые помогут как начинающим программистам, так и опытным разработчикам повысить уровень понимания JavaScript и существенно обогатить опыт его применения в своей работе. <br>
        .В книге содержится 68 проверенных подходов для написания "чистого" и работающего кода на JavaScript, которые можно легко использовать на практике. Вы узнаете, как выбирать правильный стиль программирования для каждого конкретного проекта, как управлять непредвиденными проблемами разработки, а также как работать более эффективно на каждом этапе программирования на JavaScript.`,
        "author": "Херман Д."
    },
    {
        "id": 22,
        "img": "/img/2448369_detail.jpg",
        "title": "Философия Java",
        "more details": "https://vk.com/doc31560745_475642971?hash=6ebaec25befdcbcebf&dl=f6276bbe0cc52fbbc5",
        "description": `Впервые читатель может познакомиться с полной версией этого классического труда, который ранее на русском языке печатался в сокращении. Книга, выдержавшая в оригинале не одно переиздание, за глубокое и поистине философское изложение тонкостей языка Java считается одним из лучших пособий для программистов. Чтобы по-настоящему понять язык Java, необходимо рассматривать его не просто как набор неких команд и операторов, а понять его "философию", подход к решению задач, в сравнении с таковыми в других языках программирования. На этих страницах автор рассказывает об основных проблемах написания кода: в чем их природа и какой подход использует Java в их разрешении. Поэтому обсуждаемые в каждой главе черты языка неразрывно связаны с тем, как они используются для решения определенных задач.<br>
        .4-е издание, полное.`,
        "author": "Эккель Б."
    },
    {
        "id": 23,
        "img": "/img/2426561_detail.jpg",
        "title": "Изучаем C#. 3-е издание",
        "more details": "https://vk.com/doc7608079_487955050?hash=b78041d68afa2a1486&dl=140e2f470e5892e067",
        "description": `В отличие от большинства книг по программированию, построенных на основе скучного изложения спецификаций и примеров, с этой книгой читатель сможет сразу приступить к написанию собственного кода на языке программирования C# с самого начала. Вы освоите минимальный набор инструментов, а далее примете участие в забавных и интересных программных проектах: от разработки карточной игры до создания серьезного бизнес-приложения. Второе издание книги включает последние версии C# 5.0, Visual Studio 2012 и .NET 4.5 Framework, и будет интересно всем, изучающим язык программирования С#.<br>
        .Особенностью данного издания является уникальный способ подачи материала, выделяющий серию "Head First" издательства O'Reilly в ряду множества скучных книг, посвященных программированию.`,
        "author": "Стиллмен Э., Грин Дж."
    },
    {
        "id": 24,
        "img": "/img/2423876_detail.jpg",
        "title": "Программирование на Objective-C. 6-е издание",
        "more details": "https://vk.com/doc123534285_437831251?hash=3a5b399b39bc340449&dl=67ae609e1b70437e66",
        "description": `Objective-C - стандартный язык программирования приложений на платформах Mac OS X и iPhone. Он также распространен в операционных системах Linux, Unix и Windows. Это мощный и вместе с тем простой язык объектно-ориентированного программирования, базирующийся на языке C. Цель этой книги - обучение программированию на Objective-C. Работа с Objective-C показана на множестве подробных примеров, предназначенных для решения повседневных задач. Книга разделена на три логические части. В части I излагаются основы самого языка. В части II описывается работа с обширным набором готовых классов, которые образуют фреймворк Foundation. В части III дается обзор фреймворков Cocoa и Cocoa Touch и приводится процесс разработки простого приложения iOS с использованием фреймворка iOS SDK.<br>
        .Для программистов, от новичков до профессионалов.<br>
        .6-е издание, переработанное и дополненное.`,
        "author": "Кочан С."
    },
    {
        "id": 25,
        "img": "/img/2408742_detail.jpg",
        "title": "Delphi. Программирование для Windows, OS X, iOS и Android",
        "more details": "https://vk.com/doc933956_349768050?hash=2f4655fa4cea026e9f&dl=d0141492aa9791f766",
        "description": `Книга посвящена одному из самых совершенных языков программирования Delphi ХЕ5/ХЕ6. В ней подробно рассматривается новейшая кроссплатформенная библиотека FM, позволяющая создавать полнофункциональное программное обеспечение для операционных систем Windows и OS X, а также для смартфонов и планшетных компьютеров, работающих под управлением Android и iOS. Проекты примеров из книги размещены на сайте издательства.`,
        "author": "Осипов Д."
    },
    {
        "id": 26,
        "img": "/img/2466852_detail.jpg",
        "title": "Паттерны проектирования на платформе .NET",
        "more details": "https://vk.com/doc7608079_458228404?hash=7d090267ffa508febf&dl=c420346235a4531a73",
        "description": `Паттерны проектирования остаются важным инструментом в арсенале разработчика, поскольку они опираются на фундаментальные принципы проектирования. Тем не менее, появление новых конструкций в современных языках программирования делает одни паттерны более важными, а значимость других сводит к минимуму. <br>
        .Цель данной книги - показать, как изменились паттерны проектирования за это время, как на них повлияло современное увлечение функциональным программированием, и объяснить, каким образом они используются в современных .NET-приложениях. В издании вы найдете подробное описание классических паттернов проектирования с особенностями их реализации на платформе .NET, а также примеры их использования в .NET Framework. Вы также изучите принципы проектирования, известные под аббревиатурой SOLID, и научитесь применять их при разработке собственных приложений. <br>
        .Книга предназначена для профессиональных программистов, которые хотят изучить особенности классических принципов и паттернов программирования с примерами на языке C# и понять их роль в разработке современных приложений на платформе .NET.`,
        "author": "Тепляков С."
    },
    {
        "id": 27,
        "img": "/img/2463419_detail.jpg",
        "title": "Язык программирования C. Лекции и упражнения",
        "more details": "https://vk.com/doc7608079_457201070?hash=e6b79a2a17c49fcefe&dl=d678dfc58ee436a35b",
        "description": `Эта книга представляет собой тщательно проверенное, хорошо продуманное и всеобъемлющее учебное пособие, предназначенное для программистов и разработчиков. Ставшая классикой, она обучает принципам программирования, в том числе структуризации кода и нисходящему проектированию.<br>
        .Автор и преподаватель Стивен Прата создал поучительное, ясное и проницательное введение в С. Наряду с деталями языка С объясняются фундаментальные концепции программирования. Многочисленные короткие практические примеры иллюстрируют только одну или две концепции за раз и поощряют читателей проработать новые темы, непосредственно приступив к их реальному использованию.<br>
        .Вопросы для самоконтроля и упражнения по программированию, приводимые в конце каждой главы, ориентированы на критически важные сведения и помогают читателям понять и систематизировать наиболее сложные концепции. Будучи дружественным и простым в чтении руководством, ориентированным на самостоятельное освоение, книга подойдет как студентам, изучающим программирование, так и разработчикам, которые специализируются на других языках и желают лучше понять основы этого базового языка.<br>
        .Шестое издание этой книги было обновлено и расширено с целью охвата последних наработок в языке С, а также раскрытия подробностей нового стандарта СИ. Здесь вы найдете углубленные, широкие и разнообразные подходы и инструменты, совершенствующие процесс изучения.`,
        "author": "Прата С."
    },
    {
        "id": 28,
        "img": "/img/2486534_detail.jpg",
        "title": "HTML5. Карманный справочник",
        "more details": "https://vk.com/doc2036633_462534493?hash=ccf1056dd5445927c3&dl=362e3e12a1408ac996",
        "description": `Хотите быстро найти описание элемента или атрибута HTML5, используемого на веб-странице или в веб-приложении? Перед вами классический справочник, который веб-дизайнеры и веб-разработчики стараются всегда держать под рукой на протяжении вот уже более 15 лет.<br>
        Пятое издание книги включает полное описание элементов и атрибутов HTML5 в соответствии со стандартами HTML5 Candidate Recommendation, HTML5.1 Working Draft и WHATWG.<br>
        Особенности справочника:<br>
        — упорядоченный по алфавиту список элементов и атрибутов из HTML5, HTML5.1 и стандарта WHATWG;<br>
        — примеры разметки, категории контента, модели контента и требования к начальному/конечному тегу для каждого элемента;<br>
        — описание различий между спецификациями HTML5 и HTML4.01;<br>
        — таблицы специальных символов;<br>
        — обзор библиотек API, применяемых в HTML5.<br>
        Независимо от того, являетесь ли вы опытным разработчиком сайтов или же хотите быстро создать сайт в соответствии с последними стандартами, эта полезная книга окажется для вас просто незаменимой.<br>
        Дженнифер Роббинс входила в состав команды, разработавшей в 1993 году первый коммерческий веб-сайт — Global Network Navigator (GNN), предназначенный для издательства O'Reilly.`,
        "author": "Роббинс Дж."
    },
    {
        "id": 29,
        "img": "/img/2483807_detail.jpg",
        "title": "Изучаем С++ через программирование игр",
        "more details": "https://vk.com/doc288422991_516553215?hash=b6a2bbe1ffb8e89807&dl=a70af7f9856937025b",
        "description": `Если вы хотите научиться программировать первоклассные игры, вам просто необходимо изучить язык С++. Эта книга поможет вам освоить разработку игр с сам ых азов, независимо от того, есть ли у вас опыт программирования. Гораздо интересней учиться, когда обучение превращается в игру.<br>
        .Каждая глава книги описывает самостоятельный игровой проект. В заключительной главе вам предстоит написать сложную игру, которая объединяет все приемы программирования, рассмотренные в предыдущих главах.<br>
        .Книга, которую вы держите в руках, идеально подойдет для начинающего программиста, планирующего не только как следует освоить непростой язык С++, но и поупражняться в программировании игр.`,
        "author": "Доусон М."
    },
    {
        "id": 30,
        "img": "/img/2519886_detail.jpg",
        "title": "Самоучитель JAVA с примерами и программами",
        "more details": "https://vk.com/doc2036633_461609156?hash=199e28918b6cc3b552&dl=d20db70917f4fccdc5",
        "description": `Данная книга является превосходным и эффективным учебным пособием для изучения языка программирования Java с нуля. Книга задумывалась, с одной стороны, как пособие для тех, кто самостоятельно изучает язык программирования Java, а с другой, она может восприниматься как лекционный курс с проведением практических занятий. Книга содержит полный набор сведений о синтаксисе и концепции языка Java, необходимый для успешного анализа и составления эффективных программных кодов. Материал книги излагается последовательно и сопровождается большим количеством наглядных примеров, разноплановых практических задач и детальным разбором их решений. <br>
        <br>
        Книга отличается предельной ясностью, четкостью и доступностью изложения, что вкупе с обширной наглядной практикой (примерами и программами) позволяет ее рекомендовать как отличный выбор для изучения Java.`,
        "author": "Васильев А."
    },
    {
        "id": 31,
        "img": "/img/2513814_detail.jpg",
        "title": "C# 6.0. Справочник. Полное описание языка. 6-е издание",
        "more details": "https://vk.com/doc2036633_460760390?hash=8036cf026aa1739be3&dl=a3649a1230d8331a75",
        "description": `Данное руководство, ставшее бестселлером, позволяет получить точные ответы практически на любые вопросы по С# 6.0, CLR и основным сборкам .NET Framework. После появления в 2000 году С# стал языком с выдающейся гибкостью и мощью, но его постоянный рост и совершенствование означают необходимость в дополнительном изучении.<br>
        .Организованное по концепциям и сценариям использования, существенно обновленное 6-е издание книги предлагает программистам средней и высокой квалификации лаконичный план получения знаний по языку С# и платформе .NET Framework. Читая ее, вы очень быстро поймете, почему это руководство считают авторитетным справочником по С#.`,
        "author": "Албахари Дж., Албахари Б."
    },
    {
        "id": 32,
        "img": "/img/2503717_detail.jpg",
        "title": "Swift. Основы разработки приложений под iOS",
        "more details": "https://vk.com/doc5788934_437340353?hash=284c1898325740b17f&dl=fefc9b7c199a4eab0d",
        "description": `Swift — быстрый, современный, безопасный и удобный язык программирования — появился совсем недавно и стал огромным сюрпризом для iOS-общественности. И вот, спустя год, Apple выпустила версию 2.0, а следом и 2.1, привнесшую в процесс разработки ряд значительных нововведений.<br>
        .Данная книга содержит исчерпывающую информацию для всех желающих научиться программировать на замечательном языке Swift и создавать собственные iOS-приложения. Вы найдете не только теоретический материал, но и большое количество практических примеров и заданий, которые позволят постичь все тонкости нового языка. Дерзайте, ведь, изучив Swift, вы сможете создавать приложения для любой платформы — iOS, OS X, tvOS или watchOS.`,
        "author": "Усов В."
    }
]
export default data